---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CouplerMainEndtreatment
source: html/ea85299a-1fbe-59ba-8a72-31c47f8aa88c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CouplerMainEndtreatment Property

"End Treatment 1"

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerMainEndtreatment { get; }
```